Revit 2027 API
PipeFittingAndAccessoryPressureDropData.SetDefaultEntity Method
 Stores the default entity in the data.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDefaultEntity(
	Entity defaultEntity
)
Public Sub SetDefaultEntity (
	defaultEntity As Entity
)
public:
void SetDefaultEntity(
	Entity^ defaultEntity
)
member SetDefaultEntity :
        defaultEntity : Entity -> unit
Parameters
defaultEntity Entity
 The Entity to be stored.
Exceptions
Exception | Condition
ArgumentException |  Writing of Entities of this Schema is not allowed to the current add-in.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace